# Pandas
#### Chapter 5 (Python Data Analysis)

---
# Data Structures

In [14]:
import pandas as pd
from pandas import Series, DataFrame

In [15]:
import numpy as np

## 1. Series

In [2]:
s = Series([2,5,1,6])
s

0    2
1    5
2    1
3    6
dtype: int64

In [3]:
s.values

array([2, 5, 1, 6])

In [4]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
s2 = Series([2, 5, 9, 1], index=['a','b','c','d'])
s2

a    2
b    5
c    9
d    1
dtype: int64

In [7]:
s2['b']

5

In [8]:
s2[['b', 'a']]

b    5
a    2
dtype: int64

In [9]:
s2[s2 > 2]

b    5
c    9
dtype: int64

## 2. DataFrame

In [4]:
data = {'City': ["Ibd", "Lhr", "Khi", "Pew", "Quetta"],
       'Province': ["Fedral", "Punjab", "Sindh", "KPK", "Balochistan"]}
print(type(data))
print(data)

<class 'dict'>
{'City': ['Ibd', 'Lhr', 'Khi', 'Pew', 'Quetta'], 'Province': ['Fedral', 'Punjab', 'Sindh', 'KPK', 'Balochistan']}

In [7]:
frame = pd.DataFrame(data)
print(type(frame))
frame

<class 'pandas.core.frame.DataFrame'>

     City     Province
0     Ibd       Fedral
1     Lhr       Punjab
2     Khi        Sindh
3     Pew          KPK
4  Quetta  Balochistan

A column can be retreived as Series by dict-like index or attribute

In [11]:
type(frame['City'])

pandas.core.series.Series

In [14]:
frame.City

0       Ibd
1       Lhr
2       Khi
3       Pew
4    Quetta
Name: City, dtype: object

In [16]:
frame.loc[1]

City           Lhr
Province    Punjab
Name: 1, dtype: object

In [23]:
np.arange(100, 500, 100)

array([100, 200, 300, 400])

### Creating a new column

In [8]:
frame['population'] = np.arange(0, 500, 100)
frame

     City     Province  population
0     Ibd       Fedral           0
1     Lhr       Punjab         100
2     Khi        Sindh         200
3     Pew          KPK         300
4  Quetta  Balochistan         400

In [9]:
frame.columns

Index(['City', 'Province', 'population'], dtype='object')

### use del to delete columns

In [10]:
del frame['population']
frame.columns

Index(['City', 'Province'], dtype='object')

### dict of dicts

#### Outer dict: columns
#### Inner keys as row index

In [11]:
data = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame2 = pd.DataFrame(data)
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

#### Transpose just like numpy

In [12]:
frame2.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

#### values attribute returns dataframe as a 2d array

In [20]:
frame2

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [19]:
frame2.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [21]:
frame.values

array([['Ibd', 'Fedral'],
       ['Lhr', 'Punjab'],
       ['Khi', 'Sindh'],
       ['Pew', 'KPK'],
       ['Quetta', 'Balochistan']], dtype=object)

## 3. Index Objects
For holding metadata (axis name etc.)

In [23]:
obj = pd.Series(range(3), index=['a','b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [25]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [26]:
index[1:]

Index(['b', 'c'], dtype='object')

Index objects are immutable (can't be modified by user).

Makes it safer to share among data structures

In [28]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [29]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [31]:
obj2.index is labels

True

Pandas index can contain duplicates

In [32]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

 ---
# 5.2 Essential Functionality

### Reindexing

Create new object with data conformed to a new index.

In [37]:
obj = pd.Series(range(1,5), index=['d', 'b', 'a', 'c'])
obj

d    1
b    2
a    3
c    4
dtype: int64

In [38]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a    3.0
b    2.0
c    4.0
d    1.0
e    NaN
dtype: float64

Use`ffill` (forward fill) to fill missing values, interpolation

In [40]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [41]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

`reindex` can alter row, columns or both. Default = rows

In [42]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [43]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

Columns can be indexed by columns keyword

In [44]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [46]:
frame.loc[['a', 'b', 'c', 'd'], states]

/home/neo/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping Entries from an Axis

In [47]:
obj

d    1
b    2
a    3
c    4
dtype: int64

In [48]:
obj.drop('c')

d    1
b    2
a    3
dtype: int64

In [49]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [52]:
data.drop('three', axis='columns')

          one  two  four
Ohio        0    1     3
Colorado    4    5     7
Utah        8    9    11
New York   12   13    15

Can be done in-place by `inplace=True`

## Indexing, Selection, and Filtering

Series indexing works linke numpy indexing

In [53]:
obj

d    1
b    2
a    3
c    4
dtype: int64

In [55]:
obj[obj%2==0]

b    2
c    4
dtype: int64

In [54]:
# when slicing with labels, end-point is included in output
obj['b':'c']

b    2
a    3
c    4
dtype: int64

In [56]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [57]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [58]:
data[['two', 'four']]

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

In [62]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

#### Selection with loc and iloc
Select a subset of rows and columns froma dataframe

`loc` for axis labels
`iloc` for integers

In [64]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [65]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data.iloc[1, [1, 3]]

two     5
four    7
Name: Colorado, dtype: int64

In [69]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

## Arithmetic and Data Alignment

In [7]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], 
               index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])

In [8]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [9]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [10]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [11]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [12]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [13]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [21]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### Arithmetic methods with fill values

In [23]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [24]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [25]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [26]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [27]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [30]:
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [29]:
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

### Function Application and Mapping

In [46]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bed'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         e         d
Utah    0.922498 -1.529436 -0.403818
Ohio   -0.906579 -0.183069 -0.268273
Texas  -0.558184  0.583330 -1.120773
Oregon  1.099935 -0.135736  1.218218

In [32]:
np.abs(frame)

               b         d         e
Utah    0.323257  0.686986  0.548376
Ohio    1.489806  1.282997  0.157748
Texas   1.773681  0.113452  0.812316
Oregon  0.471492  1.279300  0.344219

In [33]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    3.263486
d    1.396449
e    1.360692
dtype: float64

In [41]:
frame.apply(f, axis='columns')

Utah      1.354143
Ohio      2.651977
Texas     1.102269
Oregon    1.450770
dtype: float64

### Sorting and Ranking

In [49]:
frame

               b         e         d
Utah    0.922498 -1.529436 -0.403818
Ohio   -0.906579 -0.183069 -0.268273
Texas  -0.558184  0.583330 -1.120773
Oregon  1.099935 -0.135736  1.218218

In [48]:
frame.sort_index(axis=1)

               b         d         e
Utah    0.922498 -0.403818 -1.529436
Ohio   -0.906579 -0.268273 -0.183069
Texas  -0.558184 -1.120773  0.583330
Oregon  1.099935  1.218218 -0.135736

In [51]:
frame.T.sort_index()

       Utah      Ohio     Texas    Oregon
b  0.922498 -0.906579 -0.558184  1.099935
d -0.403818 -0.268273 -1.120773  1.218218
e -1.529436 -0.183069  0.583330 -0.135736

In [53]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [54]:
frame.sort_values(by='e')

               b         e         d
Utah    0.922498 -1.529436 -0.403818
Ohio   -0.906579 -0.183069 -0.268273
Oregon  1.099935 -0.135736  1.218218
Texas  -0.558184  0.583330 -1.120773

---
# Summarizing and Computing Descriptive Statistics

In [57]:
frame

               b         e         d
Utah    0.922498 -1.529436 -0.403818
Ohio   -0.906579 -0.183069 -0.268273
Texas  -0.558184  0.583330 -1.120773
Oregon  1.099935 -0.135736  1.218218

In [56]:
frame.sum()
# Returns column sum as a series

b    0.557669
e   -1.264911
d   -0.574646
dtype: float64

In [59]:
# Sum across columns (Rows sum)
frame.sum(axis=1)
frame.sum(axis='columns')

Utah     -1.010756
Ohio     -1.357921
Texas    -1.095628
Oregon    2.182418
dtype: float64

In [60]:
frame.describe()

              b         e         d
count  4.000000  4.000000  4.000000
mean   0.139417 -0.316228 -0.143662
std    1.019243  0.881549  0.981949
min   -0.906579 -1.529436 -1.120773
25%   -0.645283 -0.519661 -0.583057
50%    0.182157 -0.159402 -0.336046
75%    0.966857  0.044031  0.103350
max    1.099935  0.583330  1.218218

### Correlation and Covariance

In [62]:
%conda install pandas-datareader

Collecting package metadata (current_repodata.json): done
Solving environment: |
The environment is inconsistent, please check the package plan carefully
The following packages are causing the inconsistency:

  - defaults/linux-64::pango==1.42.4=h049681c_0
  - defaults/linux-64::_anaconda_depends==2020.02=py37_0
  - defaults/linux-64::anaconda==custom=py37_1
failed with initial frozen solve. Retrying with flexible solve.
Solving environment: failed with repodata from current_repodata.json, will retry with next repodata source.
Collecting package metadata (repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /home/neo/anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    certifi-2020.6.20          |           py37_0         156 KB
    conda-4.8.4                |           py37_0         2.9 MB
    pandas-datareader-0.9.0    |             py_0          72 KB
    ------------------------------------------------------------
                                           Total:         3.1 MB

The following NEW packages will be INSTALLED:

  pandas-datareader  pkgs/main/noarch::pandas-datareader-0.9.0-py_0

The following packages will be UPDATED:

  ca-certificates                                2020.1.1-0 --> 2020.6.24-0
  certifi                                 2020.4.5.2-py37_0 --> 2020.6.20-py37_0
  conda                                        4.8.3-py37_0 --> 4.8.4-py37_0



Downloading and Extracting Packages
pandas-datareader-0. | 72 KB     | ##################################### | 100%
conda-4.8.4          | 2.9 MB    | ##################################### | 100%
certifi-2020.6.20    | 156 KB    | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas_datareader.data as web

In [7]:
all_data = {ticker: web.get_data_yahoo(ticker)
    for ticker in ['AAPL', 'GOOG', 'MSFT']}

In [10]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [12]:
volume.head()

                   AAPL     GOOG        MSFT
Date
2015-08-24  162206300.0  5770300  88753700.0
2015-08-25  103601600.0  3538000  70616600.0
2015-08-26   96774600.0  4235900  63408000.0
2015-08-27   84616100.0  3491300  50943200.0
2015-08-28   53164400.0  1978700  28246700.0

In [13]:
price.tail()

                  AAPL         GOOG        MSFT
Date
2020-08-17  458.429993  1517.979980  209.772919
2020-08-18  462.250000  1558.599976  210.979996
2020-08-19  462.829987  1547.530029  209.699997
2020-08-20  473.100006  1581.750000  214.580002
2020-08-21  497.480011  1580.420044  213.020004

In [18]:
price.pct_change().head()

                AAPL      GOOG      MSFT
Date
2015-08-24       NaN       NaN       NaN
2015-08-25  0.006013 -0.012805 -0.029031
2015-08-26  0.057355  0.079992  0.055350
2015-08-27  0.029447  0.014301  0.027862
2015-08-28  0.003276 -0.011339  0.000684

```
corr()
cov()
corrwith()
```

### Unique Values, Value Counts, and Membership

In [19]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [20]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [21]:
obj.isin(['b', 'c'])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool